/* 
  Localizable.strings
  dialog

  Created by Bart Reardon on 29/5/2022.
  
*/

// error sheet
"One or more input fields are incorrect" = "One or more input fields are incorrect";
"is required" = "is required";
"doesn't match the required format" = "doesn't match the required format";

// required fields text
"* Required Fields" = "* Required Fields";

//buttons
"Cancel" = "Cancel";
"More Information" = "More Information";
"OK" = "OK";
"Select" = "Select";

//default text
"default-title" = "";
"default-message" = "";
"Click for additional information" = "Click for additional information";

"Confirm" = "Confirm";
"Downloading" = "Downloading";

"confirmation failed  <br>values do not match" = "confirmation failed  <br>values do not match";

//constructor kit labels
"Welcome to the swiftDialog builder"            = "Welcome to the swiftDialog builder";
"Select properties on the left to modify. swiftDialog will update to show the changes in realtime"        = "Select properties on the left to modify. swiftDialog will update to show the changes in realtime";
"Basic"              = "Basic";
"Content"            = "Content";
"Icon"               = "Icon";
"Window"             = "Window";
"Sidebar"            = "Sidebar";
"Data Entry"          = "Data Entry";
"Buttons"            = "Buttons";
"Button Size"         = "Button Size";
"Advanced"           = "Advanced";
"List Items"          = "List Items";
"Images"             = "Images";
"Media"              = "Media";
"Output"             = "Output";
"JSON Output"         = "JSON Output";
"Quit"              = "Quit";
"Export Command"      = "Export Command";
"Title"              = "Title";
"Colour"             = "Colour";
"Reset"              = "Reset";
"Font Size: "           = "Font Size: ";
"value:"              = "value:";
"Message"           = "Message";
"Text Alignment"      = "Text Alignment";
"Vertical Position"   = "Vertical Position";
"Window Height"       = "Window Height";
"Height value:"        = "Height value:";
"Window Width"        = "Window Width";
"Width value:"         = "Width value:";
"Window Properties"   = "Window Properties";
"Preset Sizes"        = "Preset Sizes";
"Small"              = "Small";
"Big"                = "Big";
"Screen Background Blur"         = "Screen Background Blur";
"Movable"            = "Movable";
"Force on Top"         = "Force on Top";
"Progress Bar"        = "Progress Bar";
"Progress value:"      = "Progress value:";
"Progress Text:"       = "Progress Text:";
"Banner Image"        = "Banner Image";
"Select"             = "Select";
"Watermark"          = "Watermark";
"Fill"               = "Fill";
"Opacity"              = "Opacity";
"Scale"              = "Scale";
"Position"           = "Position";
"Icon"               = "Icon";
"Visible"            = "Visible";
"Centred"            = "Centred";
"Select"             = "Select";
"Icon Size"           = "Icon Size";
"Size value:"          = "Size value:";
"Overlay"            = "Overlay";
"Infobox"            = "Infobox";
"Infotext"           = "Infotext";
"Info Text"      = "Info Text";
"Button1"            = "Button1";
"Button2"            = "Button2";
"Info Button"    = "Info Button";
"Quit on Info"         = "Quit on Info";
"Label: "              = "Label: ";
"Info Button Action: "   = "Info Button Action: ";
"AutoPlay"           = "AutoPlay";
"Autoplay Seconds"    = "Autoplay Seconds";
"Path"               = "Path";
"Caption"            = "Caption";
"Status Text"         = "Status Text";
"Status"             = "Status";
"Format output as JSON"         = "Format output as JSON";
"Textfields"         = "Textfields";
"Show"               = "Show";
"Required"           = "Required";
"Secure"             = "Secure";
"Prompt"             = "Prompt";
"Regex"              = "Regex";
"Regex Error"         = "Regex Error";
"Select"             = "Select";
"Checkbox"           = "Checkbox";
"Video"              = "Video";
"Filename"           = "Filename";
"Web"                = "Web";
"URL"                = "URL";
"Disabled"           = "Disabled";
"Enabled"            = "Enabled";
